---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException
source: html/58fc1ae1-0aea-25bb-11ee-dec2fc0386a0.htm
---
# OptionalFunctionalityNotAvailableException Methods

Retrieves data needed to serialize the target object.